import 'package:about_australia/components/card_model.dart';
import 'package:about_australia/theme/app_colors.dart';
import 'package:flutter/material.dart';

List<CardInformationModel> mapsCardsInformation = [
  CardInformationModel(
      title: "دار أوبرا سيدني",
      subTitle: "",
      backButonColor: Colors.black,
      article:
          "هذا المبنى يعد من أهم الرموز لدولة استراليا، ومن غير الممكن زيارة مدينة سيدني من دول زيارة هذا المبنى، الذي يعد من مواقع التراث العالمي لليونسكو، والذي يمتاز بالتصميم المذهل ، والموقع الرائع على سواحل المدينة.",
      assetPath: "assets/images/map/1.jpg"),
  CardInformationModel(
      title: "الحاجز المرجاني العظيم",
      subTitle: "",
      article:
          "عندما تكون في دولة استراليا فلديك الفرصة لزيارة أكبر حاجز مرجاني في العالم، هذا الحاجز يمكن رؤيته من الفضاء الخارجي بفضل مساحته الشاسعة، هنا يمكن مشاهدة أزيد من 3000 من الشعاب المرجانية، بالإضافة إلى أكثر من 600 جزيرة، وعدد هائل من أنواع الأسماك التي تعد من اجمل الاسماك على كوكبنا.",
      assetPath: "assets/images/map/2.jpg"),
  CardInformationModel(
      title: "حديقة أولورو كاتا تجوتا الوطنية",
      subTitle: "",
      article:
          "\"حديقة أولورو كاتا تجوتا الوطنية هي أحد أهم الوجهات السياحية في دولة استراليا ، وهي موطن لصخرة تعرف باسم ايرز روك او أولورو، التي تعد من عجائب الطبيعة الأكثر شهرة في البلاد وأحد مواقع التراث العالمي لليونسكو، وهي صخرة ضخمة ناتجة عن التآكل البطيء لسلسلة من الجبال كانت يوما قائمة في هذا المكان.\"",
      assetPath: "assets/images/map/3.jpg"),
  CardInformationModel(
      title: "جسر ميناء سيدني ",
      subTitle: "",
      article:
          "جسر ميناء سيدني هو جسر يقع في مدينة سيدني ، يعتبر من أشهر المعالم السياحية في البلاد، وأحد أجمل الجسور في العالم، الجسر تم بناؤه في عام 1932 ، على ارتفاع 134 مترا من ميناء المدينة، ويمتد لمسافة 500 متر، من أهم الأنشطة التي يقوم بها السياح هنا، هو الصعود الى اعلى الجسر واخذ نظرة على مدينة سيدني ومينائها.",
      assetPath: "assets/images/map/4.jpg"),
  CardInformationModel(
      title: "حديقة الجبال الزرقاء الوطنية",
      subTitle: "",
      article:
          "حديقة الجبال الزرقاء الوطنية ، حديقة تعد من مواقع التراث العالمي لليونسكو، وهي حديقة تقع على بعد 81 كم من غرب مدينة سيدني، تغطي هذه الحديقة حوالي 664 ألف فدان من الأراضي البرية، منها مسارات مخصصة للمشي تمتد لمسافة 140 كم، بالإضافة إلى كونها موطنا للعديد من الانهار والشلالات وغيرها .",
      assetPath: "assets/images/map/5.jpg"),
  CardInformationModel(
      title: "ملبورن",
      subTitle: "",
      article:
          "ملبورن هي ثاني أكبر مدينة في استراليا، وواحدة من أكثر المدن زيارة في العالم من السياح، هذه المدينة تضم مجموعة متنوعة من المعالم السياحية ، مثل المسارح والمتاحف والحدائق وغيرها ، ومن أشهر الوجهات في المدينة ، نجد نهر بارا و سوق الملكة فيكتوريا",
      assetPath: "assets/images/map/6.jpg"),
  CardInformationModel(
      title: "شاطئ بوندي",
      subTitle: "",
      article:
          "شاطئ بوندي يعد واحدا من أشهر الشواطئ في العالم ومن أجملها، وهو شاطئ يبعد حوالي دقيقة واحدة بالسيارة عن وسط المدينة، سنويا يقصد هذا المكان مئات الآلاف من السياح، من أجل التنزه أو السباحة أو ممارسة بعض الرياضات المائية، وخاصة ركوب الأمواج. ",
      assetPath: "assets/images/map/7.jpg"),
  CardInformationModel(
      title: "حديقة دينتري الوطنية ",
      subTitle: "",
      article:
          "تقع حديقة دينتري الوطنية في استراليا و يتكون جزء منها من مجموعة من الغابات المطيرة. هذه الغابات البكر الرائعة التي تبدو كأن لم يدخلها بشر من قبل. يعود عمر هذه الغابات إلى أكثر من مائة مليون عام و هذا يجعلها واحدة من أقدم النظم الإيكولوجية على وجه الأرض. هناك الكثير مما يثير الإعجاب في هذه الغابات بما في ذلك أنها موطن للآلاف من أنواع النباتات و الكثير من الأشجار التي لا تزال شامخة حتى الآن منذ أكثر من ألفان و خمسمائة عام.",
      assetPath: "assets/images/map/8.jpg"),
  CardInformationModel(
      title: "جزيرة فريزر",
      subTitle: "",
      article:
          "جزيرة فريزر هي جزيرة مدرجة في قائمة التراث العالمي، تعد أكبر جزيرة رملية في العالم، وواحدة من أكثر الوجهات جذبا للسياح في البلاد، وخاصة لممارسة بعض الرياضات مثل سباقات سيارات الدفع الرباعي، بالاضافة الى عشاق الطبيعية، في الجزيرة تعد موطنا لمجموعة من المعالم الطبيعية، منها الغابات المطيرة الذي يعيش بها أكثر من 300 نوع من الطيور.",
      assetPath: "assets/images/map/9.jpg"),
  CardInformationModel(
      title: "حديقة كاكادو الوطنية",
      subTitle: "",
      article:
          "حديقة كاكادو الوطنية هي موقع تراث عالمي، تغطي مساحة تقدر بأكثر من 194 ألف كم مربع، كأكبر حديقة وطنية في البلاد ، وثاني أكبر حديقة في العالم، داخل هذه الحديقة يمكن مشاهدة الكثير من الأشياء المثيرة، بما في ذلك الغابات المطيرة والأنهار والوديان والشلالات وغيرها، بالاضافة الى اكثر من 300 نوع مختلف من الطيور، وعدد آخر من الحيوانات مثل تماسيح المياه العذبة والمياه المالحة.",
      assetPath: "assets/images/map/10.jpg"),
];
List<CardInformationModel> travelCardInformationModel = [
  CardInformationModel(
      title: "الاستعداد للسفر إلى أستراليا",
      subTitle: "أهم ما تأخذه معك عند الذهاب لأستراليا",
      article:
          "يجب أن تأخذ معـــك :\nعملــة محليـــة – لا تعتمــد فى أن تسحب بعض الاموال عندما تصــل إلى هناك .. انت تعرف أن بعض البنوك من الصعب جداً الحصول على أي مبالغ منها فى اوقات الزحام .. لذلك ، تأكد أن يكون معك عمــلة محلية ( دولار استــرالي ) تفى بمصــاريف أسبوع كامل ، بدءاً من وصولك ..\nملابس مناسبـــة :\nتاكد انك تأخذ المناسب المناسبة للوقت الذي تسافر فيه إلى استراليــا ..اذا كان فى فصل الصيف ، خذ معك ملابس صيفية .. اذا كان فى فصل الشتاء خذ معك ملابسـاً شتوية .. وهكذا.. وخذ عدداً كاف من الملابس يكفيــك لمدة طويلة ..\nالتقنيـــة اللازمة ( فقــط ) :\nكتب ؟ .. أوراق ؟ .. ادوات مكتبية ؟ .. كلها أمور ليست مهمة ، ويمكنك الحصول عليها بسهولة فى استراليــا .. لا تشغل بالك بهذه الامور .. ولكن تأكد من أنك أخذت معك الأشياء المهمة ، مثل الحاسب الشخصي وهاتفك الذكي..\nالوثائق الرسمية :\nوهذه اهم الامور التى يجب ان تعطيها تركيزك الكامل ، وتعطيها الاولوية .. كل الاوراق الرسمية والمستندات التى تحتاج إليها فى استراليــا ، سواءاً الوثائق المطلوبة لإجتيــاز المطــار .. او الوثائق المطلوب تسليمها وفصحها من قبل ادارة الجامعة .. وغيرها من الوثائق الرسميـــة .. خذ جميع هذه الوثائق وضعها فى مكان قريب ومميز فى الحقائب .. وخذ نسخــاً عديدة منها كذلك للإحتيــاط ..\n",
      assetPath: "assets/images/travel/3.jpg"),
  CardInformationModel(
      title: "المناخ",
      subTitle: "المناخ في أهم المقاطعات الأسترالية",
      description:
          "مقاطعة العاصمة الأسترالية:\n بسبب ارتفاعها عن البحر (650 متر (2130 قدم)) والمسافة من الساحل، تتعرض مقاطعة العاصمة...",
      article:
          "مقاطعة العاصمة الأسترالية\n\nبسبب ارتفاعها عن البحر (650 متر (2130 قدم)) والمسافة من الساحل، تتعرض مقاطعة العاصمة الأسترالية لمناخ الأراضي المرتفعة شبه الاستوائي (Cfb). تحظى كانبرا بصيف مطير ولطيف نسبيًا مع أيام حارة متقطعة. تحظى كانبرا بشتاء بارد مع تكرر الصقيع والضباب. تغطي الثلوج العديد من الجبال المرتفعة في الجزء الجنوبي الغربي من المقاطعة خلال فترة من الشتاء. يمكن أن تحدث العواصف الرعدية في الفترة بين أكتوبر ومارس، وتسقط الأمطار بمعدل 623 مللي متر (25 بوصة) سنويًا، مع أقصى معدل للأمطار خلال الربيع والصيف والأقل في الشتاء.\n\nنيو ساوث ويلز\n\nيتعرض أكثر من نصف نيو ساوث ويلز للمناخ القاحل أو شبه القاحل. يتمتع الجزء الشرقي بمناخ معتدل، يتراوح من المناخ شبه الاستوائي الرطب في الحدود الشمالية مرورًا بسنترال كوست ومعظم سيدني، ومناخ محيطي في الساحل الجنوبي. تقع منطقة الجبال الثلجية في الجنوب الشرقي في نطاق المناخ الألبي أو منطقة المناخ المحيطي شبه القطبي، مع طقس منعش إلى بارد طوال العام وسقوط الثلوج في الشتاء. بالدخول في اليابسة، يصبح المناخ شبه قاحل وصحراوي باتجاه الأجزاء الغربية من الولاية.\nكما يكون الطقس في النصف الجنوبي من الولاية دافئًا بشكل عام وحارًا في الصيف ومنعشًا في الشتاء. تعتبر الفصول أكثر وضوحًا في النصف الجنوبي من الولاية، خاصة في المنحدرات الجنوبية الغربية وسنترال ويست ومنطقة ريفيرينا. تأتي ذروة الأمطار في الصيف في معظم أجزاء الولاية، على الرغم أن منطقة ريفيرينا، التي تقع في منتصف الجزء الجنوبي من الولاية وتحد فيكتوريا، تحظى بصيف جاف وتأتي ذروة الأمطار في الشتاء. في أيام الصيف الحارة، يلطف «باستر الجنوبي» الحرارة الشديدة التي تتعرض لها المناطق الساحلية في منطقة نيو ساوث ويلز، من بورت ماكواري باتجاه الجنوب وصولًا إلى ناورا.\nيعتبر الجزء الشمالي الغربي هو الأدفأ، حيث يكون الصيف حارًا للغاية، ويكون الشتاء أبرد وأكثر جفافًا.\n",
      assetPath: "assets/images/about_australia/5.jpg"),
  CardInformationModel(
      title: "المواصلات",
      subTitle: "أهم وسائل النقل العام في أستراليا",
      article:
          "يوجد لدى أستراليا العديد من وسائل النقل العامة المتقدمة. وهي تقدم أربع خيارات رئيسية هم: القطار، والحافلات، والعبارات، والترام. وفي الواقع، لا توجد أنهار بكل مدينة أو مرفأ لذلك لن تجد عبارات متوفرة بكل مكان. وبالمثل أيضاً لن تجد قطار الترام البطيء بكل المدن.\nكم يتكلف ركوب وسائل المواصلات العامة بأستراليا؟\nتعتمد تكاليف المواصلات العامة في معظم المدن على المسافة المقطوعة. ففي مدينة سيدني مثلاً، تبدأ الأجرة الفردية لشخص واحد من 2.10 دولاراً أمريكياً إلى 4.50 دولاراً أمريكياً. وفي أغلب الأحوال ستجد أن العبارات أكثر تكلفة.\n",
      assetPath: "assets/images/travel/2.jpg"),
  CardInformationModel(
      title: "الفنون في أستراليا",
      subTitle: "الفن في أستراليا وجذور الفن الأسترالي",
      article:
          "يعتقد أن الفنون البصرية الأسترالية قد بدأت في الكهوف عن طريق السكان الأصليون. واعتمد الأستراليين الأصليين إلى حد كبير على نقل فنونهم الشعبية شفهيا، من خلال الاحتفالات والقصص.\n ومنذ الاستيطان الأوروبي، أصبحت المناظر الطبيعية هي أحد مواضيع الفن الأسترالي. المناظر الطبيعية في البلاد لا تزال يشكل مصدر إلهام للفنانين الحداثية الأستراليين، وقد تم تصوير ذلك في الأعمال المشهود لهم من قبل من أمثال سيدني نولان، فريد ويليامس، سيدني لونغ، وكليفتون بف. ويعد الفن المعاصر للسكان الأصليين هو الحركة الفنية الوحيدة ذات الأهمية الدولية للخروج من أستراليا و\"أخر حركة فنية عظيمة للقرن العشرين\".\n كما تأثر الأدب الأسترالي بالمناظر الطبيعية أيضا، فأعمال كتاب مثل بانجو باترسون، هنري لوسون، ودوروثيا ماكيلار تعد مثالا على ذلك. وكون البلاد مستعمرة سابقا، وتمثل ذلك في الأدب في وقت مبكر، له شعبية مع أستراليا الحديثة. وفي عام 1973، منح باتريك وايت على جائزة نوبل في الأدب، وهو أول أسترالي يحقق هذا.",
      assetPath: "assets/images/travel/painting.jpg"),
  CardInformationModel(
      title: "الطعام",
      subTitle: "ماهي أهم المأكلوات اللتي يأكلها أهل أستراليا",
      article:
          "الطــعام المحلي التقليــدي:\n\"هو الطعام الذي توارثته الاجيــال من الاستراليين الأصليين ، والذين تأثــر به الاوروبيــون القادمون إلى القــارة منذ العام 1788 .. وهو مزيــج من الاطعمة النبــاتية والفواكه ولحوم الكانجــارو الذيذة .. وتوجد الآن فى العديد من متاجر الطعام والمطاعم المختلفة المنتشــرة حول القارة ..\"\nالطعــام الاسترالي الحديث :\n\"وهو الشبيه جداً إلى الطعام الاوروبي المُستقدم للقــارة منذ القــرن الثامن عشــر ، وإن كانت الاختلافات فى المناخ والعادات وطبيعة البــلاد أدخل تطوراً وتنوعاص كبيــراً على هذه الاطعمة والوجبــات ، مما اعطــاها خصوصية استرالية واضحة ..\\nكما يشمــل المطبخ الاسترالي أفكــار عديدة من المطابخ العالمية ، مثل التايلاندية والصينية واليابانية والفيتنامية والفرنسية والايطالية واليونانية والبريطانية .. إلى جانب الكثيــر جداً من الافكــار الشــرقية العربية فى الطهي ..\\n\"\nالوجبــات السريعة :\n\"فى استراليــا ، يوجد ميــل كبيــر من سكانها ومقيميها لتنــاول الاطعمة السريعة نتيجة سرعة وتيرة الحيــاة ذاتها .. كل الوجبــات العالمية المعروفة والمطاعم الدوليــة والمحلية ، تجدها منتشــرة فى كل مكان فى استراليــا ..\"\nالمأكولات البحرية\n\"تشتهر أستراليا بمأكولاتها البحرية و أطباق السمك الشهية. يوجد في أستراليا أكثر من 6000 نوع من أنواع السمك و ثمار البحر الشهية.\"\nأسمــاء الأطعمة :\n\"عادة استــرالية قديمة ، هي تسمية بعض الوجبــات الشهيــرة بأسمها معينة .. فمثلاً وجبة الـبافلوفا الشهيـــرة ، وجدت فى استراليا من العام 1935 نسبة لراقصة الباليه الروسية الشهيــرة وقتها ( بافلوفا ) ! .. وغيرها الكثيــر جداً من الوجبــات التى تُسمى على أسماء شخصيــات أو ظروف معيـــنة ..\"\n",
      assetPath: "assets/images/travel/1.jpg"),
  CardInformationModel(
      title: "الأنشطة",
      subTitle: "أهم الأنشطة الممتعة في أستراليا ",
      description:
          "تحظى الشواطئ الأسترالية بشهرة واسعة على مستوى العالم، ولذلك فإن أي زائر للبلاد عليه أن يُخصص بع...",
      article:
          "تحظى الشواطئ الأسترالية بشهرة واسعة على مستوى العالم، ولذلك فإن أي زائر للبلاد عليه أن يُخصص بعض الوقت ليقضيه في الاستمتاع بالشواطئ الرملية وتعلم ركوب الأمواج.وربما يستغرق الأمر بعض الوقت ولكنها ستكون تجربة جديدة. \n\nالقفز بالمظلات هو بالتأكيد أحد أكثر الأشياء الممتعة في أستراليا. أنت حرفيًا ومجازيًا على قمة العالم.والمدربين مؤهلين جدا مما يوفر لك الراحة للاستمتاع بهذه التجربة.\n\n ويمكنك زيارة مرصد سيدني الفلكي صباحا, حيث انه مليء بالقطع الأثرية المثيرة للاهتمام في مبنى تاريخي رائع ,و لكن التجربة الحقيقية هي في الليل حيث يمكنك مشاهدة أضواء المدينة, بالإضافة الى مشاهدة النجوم بواسطة التليسكوب و عرض في القبة السماوية.\n\n من أجمل الأماكن الترفيهية هو البيت المدهش في جزيرة فيليب، وهو عبارة عن بيت مصمم بطريقة غريبة ومدهشة وكل غرفة فيه تحتوي على خدع بصرية وخدع هندسية جميلة وممتعة، وتحفز الاطفال على التفكير فيها.\n\n و الجدير بالذكر أنه يمكنك السباحة بالإضافة لإطعام مختلف الأسماك، من القرش وسمك الراي اللاسع إلى الحيتان والدلافين. انها تجربة ممتعة وفريق العمل يزودك بمعلومات عن الأسماك، فتنهي يومك بذكريات جميلة ومعلومات جديدة.\n  ",
      assetPath: "assets/images/travel/4.jpg"),
  CardInformationModel(
      title: "الإقامة",
      subTitle: "أماكن السكن في أستراليا",
      article:
          "نظرا لارتفاع أسعار الإقامة في فنادق أستراليا، يمكنك الإقامة في النزل، وخلافا للاعتقاد الشائع، النزل ليست فقط للشباب، بل تعتبر أماكن مريحة ذات غرف ودورات مياه خاصة، وإن كنت لا تمانع، فإنها يمكن أن تكون بديلا رخيص الثمن يوفر لك مزيدا من النقود.\n وإذا كنت مسافرا مع العائلة، أو مع الأصدقاء، هناك الكثير من الخياراتللإقامة بأسعار معقولة في جميع أنحاء أستراليا بأماكن تتراوح بين غرف في بيوت السكان المحليين، ومنازلجميلة مناسبة للمجموعات وتستطيع أن تصل إليها عبر Airbnb.\n وتختلف تكاليف الإقامة من ولاية لأخرى ومن مدينة لأخرى، كما تتباين حسب نوع الإقامة.\n هناك ثلاث مناطق مركزية للسواح ينصح السواح بالسكن فيها لتميز موقعها وقربه من الأسواق والمطاعم والمقاهي والأماكن السياحية وهي :منطقة الدارلنج هاربر, منطقة السيركلار كي, و شارع جورج. طبعا هناك مناطق اخرى مثل أوبرن ولوكمبا وقرين أيكر التي تشتهر بأنها أحياء سكنية يقطنها العرب المقيمين في استراليا وكذلك الطلبة الخليجيين وتشتهر هذه المناطق بكثرة المحلات والمطاعم العربية.",
      assetPath: "assets/images/travel/room.jpg"),
];

List<CardInformationModel> aboutAustraliaInformationModel = [
  CardInformationModel(
      title: "حقائق مبهرة",
      subTitle: "بطولة العالم لسباق الصراصير؟",
      article:
          "1- إذا زرت شاطئًا واحد من شواطئ استراليا كل يوم, تحتاج 27 سنة لتزورهم جميعًا.\n2- في كل سنة تقام في أستراليا المسابقة العالمية لسباق الصراصير.\n3- أستراليا هي القارة الوحيدة في العالم بلا أي براكين نشطة.\n4- لدى أستراليا من الخراف 3 أضعاف ما لديها من البشر.\n5- أكبر عدد من اليونانيين بعد اليونان, متواجد في ميلبورن فيكتوريا.\n6- قام أحد الأستراليين مرة بمحاولة بيع نيوزيلندا على موقع. e-bay.\n7- الجبال الألبية في أستراليا يهطل فيها الثلج أكثر من ما يهبط في نيوزلندا.\n8- معظم النباتات المميزة, والحيوانات من الجرابيات \"كالكنغر والكوالا والكوكاس\" لا تتواجد إلا في أستراليا.\n9- أستراليا هي ثاني دولة في العالم تعطي النساء حق التصويت في الانتخابات عام 1902\n10- تم اختيار كانبرا لتكون العاصمة لأن ميلبورن وسيدني لم يتوقفوا عن الجدال حول أي منهم يجب أن تكون العاصمة.\n\n",
      assetPath: "assets/images/about_australia/4.jpg"),
  CardInformationModel(
      title: "التعليم",
      subTitle: "الاهتمام بالعلم في أستراليا",
      article:
          "يكون حضور المدارس في أستراليا إلزامي. حيث يتلقى كل الأطفال 11 عاماً إجبارياً من التعليم في ما بين العمر 6 إلى 16، ثم يعطوهم عامين اختياريين إضافيين، وهذا ساهم في محو الأمية بنسبة كبيرة. ويكون هناك سنة تمهيدية قبل العام الأول من الدراسة, وإن لم تكن إلزامياً إلا أنه عادة مايقوموا بها. وفي برنامج الدولي لتقييم الطلاب، عادة ماتكون أستراليا ضمن الأوائل الخمس في من أكثر من ثلاثين دولة كبرى متقدمة. وتصنف المنظمة التعاون وتنمية البلاد أستراليا ضمن أكثر الدول تكلفة لحضور الجامعة. يعدّ (58%) من الأسترالين الذيين يتراوح عمرهم ما بين 25 و64 عام لديهم مؤهلات مهنية ومؤهلات التعليم العالي, ومعدل التخرج الجامعي (48%) وهو يعدّ أكبر مؤهل ضمن منظمة التعاون وتنمية البلاد.\nتنافس الجامعات الأسترالية على مراكز متقدمة في تصنيف الجامعات العالمي حيث حصلت جامعة ملبورن على المرتبة 36 على مستوى العالم حسب تصنيف التايمز للتعليم العالي للتصنيف العالمي للجامعات لعامي 2010-2011 وحصلت جامعة أستراليا الوطنية على المرتبة 43 وجامعة سيدني على المرتبة 71 وجامعة أدليد على المرتبة 73 وجامعة كوينزلاند على المرتبة 81 وجامعة نيو ساوث ويلز على المرتبة 152 وجامعة موناش على المرتبة 178.\n",
      assetPath: "assets/images/about_australia/3.jpg"),
  CardInformationModel(
      title: "الحياة البرية في أستراليا",
      subTitle: "عن الطبيعة والحيوانات في أستراليا",
      article:
          "على الرغم من أن معظم أستراليا مناطق شبه قاحلة أو صحراء، إلا أنها تمتلك مجموعة متنوعة من البيئات مثل من بيئة الآلبية إلى الغابات الاستوائية، ولذلك تصنف ضمن البلدان ذات التنوع الحيوي الشديد. وبسبب عمر القارة الكبير، تتنوع الأقاليم مناخية، وعزلة جغرافية طويلة المدى، معظم الكائنات الحية في أسترالية فريدة من نوعها ومتنوعة. حوالي (85%) من الأزهار و(84%) من الثدييات و(45%) من الطيور و(89%) الأسماك التي تعيش في المناخ المعتدل متوطنة بالقارة. ولدى أستراليا عدد كبير من الزواحف، حيث تصل إلى 755 نوع.\nتتألف معظم غابات أستراليا من الأنواع دائماً الخضرة، خصوصاً أشجار الكينا في المناطق الأقل قاحلة وطلح في الصحاري المناطق الجافة كأكثر الأنواع انتشاراً. ومن بين الحيوانات الأسترالية الأكثر شهرة هم أحاديات المسلك (خلد الماء والنضناض); ومجموعة من الجرابيات، مثل الكنغر والكوالا والومبت والطيور مثل إيمو والكوكابورا. وتعدّ أستراليا موطنا للعديد من الحيوانات الخطيرة في ما بينهم أكثر أفاعي سامة في العالم. انقرضت العديد من النباتات منذ الاستيطان الأول البشري للقارة,بما في ذلك كائنات حيوانية ضخمة أسترالية، وأخرون اختفى منذ الاستيطان الأوروبي، مثل ثيلسين.\nهناك العديد من المناطق الإيكولوجية الأسترالية، والعديد من الأنواع مهددة بسب النشاطات الإنسانية.وقانون حماية البيئة الفدرالية وحفظ التنوع الحيوي لعام 1999 هو الإطار القانوني لحماية الأنواع المهددة بالانقراض. وأنشا العديد من المحميات الطبيعية في إطار الإستراتيجية الدولية لحفظ وحماية التنوع البيئي الأسترالية والحفاظ على النظم الايكولوجية الفريدة.\nوصنفت 65 منطقة رطبة ضمن اتفاقية رامسار, وأنشا 16 مواقع للتراث العالمي. وكانت أستراليا تحتل المرتبة رقم 51 ضمن 163 في مؤشر الأداء البيئي 2010.\n",
      assetPath: "assets/images/about_australia/1.jpg"),
  CardInformationModel(
      title: "الرياضة",
      subTitle: "عن الاهتمام بالرياضة وأهم الرياضات في أستراليا",
      article:
          "يحرص حوالي 24 بالمئة من الأستراليين من هم 15 سنة أو أكبر على الانخراط في أنشطة رياضية منظمة. تعد كرة القدم الأسترالية والكريكت من أكثر الرياضات شعبية في أسترالية. كما أن أستراليا تتميز بالرياضات المائية وخاصة ركوب الأمواج، رياضات الزوارق السريعة والزوارق الشراعية. وتعد أستراليا ثاني أعلى دولة من حيث الفوز بالمدليات في رياضة السباحة بالألعاب الأوليمبية. \nاشتركت أستراليا في في جميع دورات ألعاب أولمبية صيفية في الفترة الحديثة. وفي جميع دورات ألعاب الكومنولث أيضا. واستضافت أستراليا دورتي الألعاب الأوليمبية الصيفية في 1956 بملبرون و2000 بسيدني. كما استضافت أستراليا أربع دورات لألعاب الكومنولث في أعوام 1938 و1962 و1982 و2006. بعض الفاعليات الرياضية الكبيرة التي استضافتها أستراليا تشمل بطولة أستراليا المفتوحة للتنس ومباريات دولية في رياضة الكريكت وجائزة أستراليا الكبرى للفورملا وان.\n",
      assetPath: "assets/images/about_australia/2.jpg"),
  CardInformationModel(
      title: "الاكتشافات والاختراعات",
      subTitle: "اختراعات كان لأستراليا الفضل في استخدامنا لها اليوم",
      article:
          "1- المثقاب الكهربائي\nكيف ستكون المشاريع الصغيرة بدون المثقاب الكهربائي؟ يمكننا شكر الأسترالي آرثر جيمس وزملاءه لتصميمهم هذا الاختراع. ففي العام 1889، ابتكر المهندس الكهربائي الأسترالي آرثر جيمس أول مثقاب كهربائي في العالم. طبعا لم يكن مثل الذي تستخدمه اليوم، ولكنه كان قادرًا على التنقيب في صخور مناجم الفحم\n \n2- خرائط غوغل\nفكر في مدى سهولة حياتك بوجود خرائط غوغل، والفضل يعود للأسترالييْن نيل غوردون وستيفن ما، بالإضافة إلى الشقيقين الدانماركيين لارس وجين راسموسن، حيث طوروا نظام خرائط في أوائل العقد الأول من القرن العشرين.سُمي نظام الخرائط باسم \"وير2 تكنولوجيز\" (Where 2 Technologies) قبل شرائها من غوغل عام 2004، مما سمح للفريق بمتابعة العمل مع غوغل على المشروع\n3- الصندوق الأسود\nغيّر اختراع الصندوق الأسود مجالات السفر الجوي التجاري، فالفكرة التي ابتكرها العالم الأسترالي الدكتور ديفد وارين كانت مدفوعة بحقيقة فقده والده في مأساة طائرة، مما جعله يخترع صندوقا غير قابل للتلف تقريبًا، ومثبتا في كل شركة طيران تجارية، ويخدم غرض تسجيل اللحظات الأخيرة في حالة حدوث عطل.فالهدف الشامل من الاختراع هو الحصول على فهم أفضل لسبب حدوث العطل حتى يتمكن المهندسون من تحسين الطائرة لضمان عدم حدوثه مرة أخرى. ومن الجيد أيضًا الإشارة إلى أن الصندوق ليس أسود اللون في الحقيقة، ولكنه برتقالي ملون بحيث يمكن التعرف عليه بسهولة\n4- الواي فاي\nفي أيامنا هذه، لا تستطيع الجلوس بالبيت أو أي مكان آخر دون أن ترتبط بالواي فاي. في العام 1992 طوّر الدكتور جون سوليفان وعدد من زملائه تقنية الواي فاي التي ولدت من الأبحاث في منتصف سبعينيات القرن الماضي من مجال علم الفلك الراديوي. وكان الفريق يبحث عن موجات باهتة سوداء عندما اكتشفوا موجات الواي فاي. الآن يستخدم هذه التقنية مليارات الأشخاص حول العالم\n \n5- الموجات فوق الصوتية\nاكتشف قسم أبحاث الموجات فوق الصوتية التابع لفرع مختبرات الكومنولث للصوتيات، الذي تم اختصاره في وقت لاحق إلى معهد الموجات فوق الصوتية، طريقة للتمييز بين أصداء الموجات فوق الصوتية التي تنطلق من الأنسجة الرخوة في الجسم وتحولها إلى صور تلفزيونية. كان ذلك عام 1976 عندما سوّقت شركة\"أوسونيكس\" الأسترالية الماسح الضوئي بالموجات فوق الصوتية.وغيرت تقنية الموجات فوق الصوتية فحوصات الولادة، كما تستخدم في تشخيص المشكلات الطبية للثدي والبطن والأعضاء التناسلية\n",
      assetPath: "assets/images/about_australia/tech.jpg"),
  CardInformationModel(
      title: "السياسة في أستراليا",
      subTitle: "عن نظام الحكم في أستراليا",
      article:
          "يعدّ نظام الحكم في أستراليا ملكية دستورية بقوات فدرالية مقسمة. وهي تستخدم نظام برلماني من قبل حكومة مع إليزابيث الثانية التي تمتلك منصب ملكة أستراليا، وهي أيضاً صاحبة المنصب كملكة باقي دول الكومنولث. تسكن الملكة في المملكة المتحدة، ومن يمثلها هم خلفاءها في أستراليا (يمثلها الحاكم العام في المرحلة الفدرالية والمحافظين في مراحل الدولة)، وتعطى السلطة التنفيذية السيادة تحت الدستور الأسترالي، لكن من يمنحها القوة لتنفيذها الحاكم العام. كان أبرز قرار للحاكم العام هو إقالة حكومة وايتلات أثناء الأزمة الدستورية عام 1975.\nتنقسم الحكومة الفدرالية لثلاثة فروع\nالسلطة التشريعية: برلمان من مجلسين، يتألف من الملكة (ويمثلها الحاكم العام) ومجلس الشيوخ ومجلس النواب،\nالسلطة التنفيذية: المجلس التنفيذي، وينفذ أوامر الحاكم العام ويتكون من رئيس الوزراء ووزراء الدولة،\nالسلطة القضائية: المحكمة العليا الأسترالية والمحاكم الفدرالية الأخرى، ويعين القضاة من قبل الحاكم العام بعد الأخذ بمشورة المجلس.\nيوجد في مجلس الشيوخ (الهيئة التشريعية العليا) 76 عضوًا: 12 منهم من سائر الولايات وإثنين منهم من الإقليمين (إقليم العاصمة الأسترالية والإقليم الشمالي), ويتكون مجلس النواب (الهيئة التشريعية الأدنى) من 150 عضو، ويعرفون باسم \"الناخبين\" أو \"المقاعد\", وبكل ولاية لا يقل بها عدد المقاعد عن 5، وينتخبوا لمدة ثلاثة سنوات; بينما مجلس الشيوخ يكون لمدة 6 سنوات باستثناء القادمين من الإقليمين، حيث أن شروطهم مرتبطة بالدورة الانتخابية لمجلس النواب، وبالتالي 40 من 76 مقعد فقط يدخلون الدائرة الانتخابية إن لم تعطل الدورة.\n",
      assetPath: "assets/images/about_australia/meeting.jpg"),
  CardInformationModel(
      title: "التقسيمات الإدارية لأستراليا",
      subTitle: "لولايات الأسترالية وعواصمها",
      article:
          "نيو ساوث ويلز وعاصمتها سيدني\nكوينزلاند وعاصمتها بريزبان\nجنوب أستراليا وعاصمتها أديليد\nتازمانيا وعاصمتها هوبارت\nفيكتوريا وعاصمتها مِلبورن\nأستراليا الغربية وعاصمتها بيرث\nإقليم شمالي وعاصمته داروِن\nمقاطعة العاصمة الأسترالية وعاصمتها كانبيرا",
      assetPath: "assets/images/about_australia/flag.jpg"),
];
